export const prefectures = [
  { name: "北海道", lat: 43.06417, lon: 141.34694 },
  { name: "青森", lat: 40.82444, lon: 140.74 },
  { name: "岩手", lat: 39.70361, lon: 141.1525 },
  { name: "宮城", lat: 38.26889, lon: 140.87194 },
  { name: "秋田", lat: 39.71861, lon: 140.1025 },
  { name: "山形", lat: 38.24056, lon: 140.36333 },
  { name: "福島", lat: 37.75, lon: 140.46778 },

  { name: "東京", lat: 35.6812, lon: 139.7671 },
  { name: "神奈川", lat: 35.44778, lon: 139.6425 },
  { name: "埼玉", lat: 35.85694, lon: 139.64889 },
  { name: "千葉", lat: 35.60472, lon: 140.12333 },

  { name: "新潟", lat: 37.90222, lon: 139.02361 },
  { name: "富山", lat: 36.69528, lon: 137.21139 },
  { name: "石川", lat: 36.59444, lon: 136.62556 },
  { name: "福井", lat: 36.06528, lon: 136.22194 },

  { name: "山梨", lat: 35.66389, lon: 138.56833 },
  { name: "長野", lat: 36.65139, lon: 138.18111 },

  { name: "岐阜", lat: 35.39111, lon: 136.72222 },
  { name: "静岡", lat: 34.97694, lon: 138.38306 },
  { name: "愛知", lat: 35.18028, lon: 136.90667 },

  { name: "大阪", lat: 34.6937, lon: 135.5023 },
  { name: "京都", lat: 35.01164, lon: 135.7681 },
  { name: "兵庫", lat: 34.69139, lon: 135.18306 },

  { name: "奈良", lat: 34.68528, lon: 135.83278 },
  { name: "滋賀", lat: 35.00444, lon: 135.86833 },
  { name: "和歌山", lat: 34.22611, lon: 135.1675 },

  { name: "鳥取", lat: 35.50361, lon: 134.23833 },
  { name: "島根", lat: 35.47222, lon: 133.05056 },
  { name: "岡山", lat: 34.66167, lon: 133.935 },

  { name: "広島", lat: 34.39639, lon: 132.45944 },
  { name: "山口", lat: 34.18583, lon: 131.47139 },

  { name: "徳島", lat: 34.06583, lon: 134.55944 },
  { name: "香川", lat: 34.34028, lon: 134.04333 },
  { name: "愛媛", lat: 33.84167, lon: 132.76611 },
  { name: "高知", lat: 33.55972, lon: 133.53111 },

  { name: "福岡", lat: 33.60639, lon: 130.41806 },
  { name: "佐賀", lat: 33.24944, lon: 130.29889 },
  { name: "長崎", lat: 32.74472, lon: 129.87361 },
  { name: "熊本", lat: 32.78972, lon: 130.74167 },
  { name: "大分", lat: 33.23806, lon: 131.6125 },
  { name: "宮崎", lat: 31.91111, lon: 131.42389 },
  { name: "鹿児島", lat: 31.56028, lon: 130.55806 },

  { name: "沖縄", lat: 26.2125, lon: 127.68111 },
];